tutorials/heatTransfer/buoyantSimpleSolver/buoyantCavity/0/epsilon
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-06;

boundaryField
{
    frontAndBack
    {
        type            compressible::epsilonWallFunction;
        value           uniform 4e-06;
    }
    topAndBottom
    {
        type            compressible::epsilonWallFunction;
        value           uniform 4e-06;
    }
    hot
    {
        type            compressible::epsilonWallFunction;
        value           uniform 4e-06;
    }
    cold
    {
        type            compressible::epsilonWallFunction;
        value           uniform 4e-06;
    }
}


// ************************************************************************* //
