tutorials/heatTransfer/buoyantSimpleSolver/buoyantCavity/0/omega
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    frontAndBack
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
    topAndBottom
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
    hot
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
    cold
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
}


// ************************************************************************* //
